Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM310.h
#define PWMCON6 PWMCON6
extern volatile unsigned int  PWMCON6 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON6BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned MTBS:1;
      unsigned :1;
      unsigned DTCP:1;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON6BITS;
extern volatile PWMCON6BITS PWMCON6bits __attribute__((__sfr__));

#define IOCON6 IOCON6
extern volatile unsigned int  IOCON6 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON6BITS {
  union {
    struct {
      unsigned OSYNC:1;
      unsigned SWAP:1;
      unsigned CLDAT:2;
      unsigned FLTDAT:2;
      unsigned OVRDAT:2;
      unsigned OVRENL:1;
      unsigned OVRENH:1;
      unsigned PMOD:2;
      unsigned POLL:1;
      unsigned POLH:1;
      unsigned PENL:1;
      unsigned PENH:1;
    };
    struct {
      unsigned :2;
      unsigned CLDAT0:1;
      unsigned CLDAT1:1;
      unsigned FLTDAT0:1;
      unsigned FLTDAT1:1;
      unsigned OVRDAT0:1;
      unsigned OVRDAT1:1;
      unsigned :2;
      unsigned PMOD0:1;
      unsigned PMOD1:1;
    };
  };
} IOCON6BITS;
extern volatile IOCON6BITS IOCON6bits __attribute__((__sfr__));

#define FCLCON6 FCLCON6
extern volatile unsigned int  FCLCON6 __attribute__((__sfr__));
__extension__ typedef struct tagFCLCON6BITS {
  union {
    struct {
      unsigned FLTMOD:2;
      unsigned FLTPOL:1;
      unsigned FLTSRC:5;
      unsigned CLMOD:1;
      unsigned CLPOL:1;
      unsigned CLSRC:5;
      unsigned IFLTMOD:1;
    };
    struct {
      unsigned FLTMOD0:1;
      unsigned FLTMOD1:1;
      unsigned :1;
      unsigned FLTSRC0:1;
      unsigned FLTSRC1:1;
      unsigned FLTSRC2:1;
      unsigned FLTSRC3:1;
      unsigned FLTSRC4:1;
      unsigned :2;
      unsigned CLSRC0:1;
      unsigned CLSRC1:1;
      unsigned CLSRC2:1;
      unsigned CLSRC3:1;
      unsigned CLSRC4:1;
    };
  };
} FCLCON6BITS;
extern volatile FCLCON6BITS FCLCON6bits __attribute__((__sfr__));

#define PDC6 PDC6
extern volatile unsigned int  PDC6 __attribute__((__sfr__));
#define PHASE6 PHASE6
extern volatile unsigned int  PHASE6 __attribute__((__sfr__));
#define DTR6 DTR6
extern volatile unsigned int  DTR6 __attribute__((__sfr__));
#define ALTDTR6 ALTDTR6
extern volatile unsigned int  ALTDTR6 __attribute__((__sfr__));
#define SDC6 SDC6
extern volatile unsigned int  SDC6 __attribute__((__sfr__));
#define SPHASE6 SPHASE6
extern volatile unsigned int  SPHASE6 __attribute__((__sfr__));
#define TRIG6 TRIG6
extern volatile unsigned int  TRIG6 __attribute__((__sfr__));
__extension__ typedef struct tagTRIG6BITS {
  union {
    struct {
      unsigned :3;
      unsigned TRGCMP:13;
    };
    struct {
      unsigned :3;
      unsigned TRGCMP0:1;
      unsigned TRGCMP1:1;
      unsigned TRGCMP2:1;
      unsigned TRGCMP3:1;
      unsigned TRGCMP4:1;
      unsigned TRGCMP5:1;
      unsigned TRGCMP6:1;
      unsigned TRGCMP7:1;
      unsigned TRGCMP8:1;
      unsigned TRGCMP9:1;
      unsigned TRGCMP10:1;
      unsigned TRGCMP11:1;
      unsigned TRGCMP12:1;
    };
  };
} TRIG6BITS;
extern volatile TRIG6BITS TRIG6bits __attribute__((__sfr__));

#define TRGCON6 TRGCON6
extern volatile unsigned int  TRGCON6 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON6BITS {
  union {
    struct {
      unsigned TRGSTRT:6;
      unsigned :1;
      unsigned DTM:1;
      unsigned :4;
      unsigned TRGDIV:4;
    };
    struct {
      unsigned TRGSTRT0:1;
      unsigned TRGSTRT1:1;
      unsigned TRGSTRT2:1;
      unsigned TRGSTRT3:1;
      unsigned TRGSTRT4:1;
      unsigned TRGSTRT5:1;
      unsigned :6;
      unsigned TRGDIV0:1;
      unsigned TRGDIV1:1;
      unsigned TRGDIV2:1;
      unsigned TRGDIV3:1;
    };
  };
} TRGCON6BITS;
extern volatile TRGCON6BITS TRGCON6bits __attribute__((__sfr__));

#define PWMCAP6 PWMCAP6
extern volatile unsigned int  PWMCAP6 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCAP6BITS {
  union {
    struct {
      unsigned :3;
      unsigned PWMCAP:13;
    };
    struct {
      unsigned :3;
      unsigned PWMCAP0:1;
      unsigned PWMCAP1:1;
      unsigned PWMCAP2:1;
      unsigned PWMCAP3:1;
      unsigned PWMCAP4:1;
      unsigned PWMCAP5:1;
      unsigned PWMCAP6:1;
      unsigned PWMCAP7:1;
      unsigned PWMCAP8:1;
      unsigned PWMCAP9:1;
      unsigned PWMCAP10:1;
      unsigned PWMCAP11:1;
      unsigned PWMCAP12:1;
    };
  };
} PWMCAP6BITS;
extern volatile PWMCAP6BITS PWMCAP6bits __attribute__((__sfr__));

#define LEBCON6 LEBCON6
extern volatile unsigned int  LEBCON6 __attribute__((__sfr__));
typedef struct tagLEBCON6BITS {
  unsigned BPLL:1;
  unsigned BPLH:1;
  unsigned BPHL:1;
  unsigned BPHH:1;
  unsigned BCL:1;
  unsigned BCH:1;
  unsigned :4;
  unsigned CLLEBEN:1;
  unsigned FLTLEBEN:1;
  unsigned PLF:1;
  unsigned PLR:1;
  unsigned PHF:1;
  unsigned PHR:1;
} LEBCON6BITS;
extern volatile LEBCON6BITS LEBCON6bits __attribute__((__sfr__));

#define LEBDLY6 LEBDLY6
extern volatile unsigned int  LEBDLY6 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY6BITS {
  union {
    struct {
      unsigned :3;
      unsigned LEB:9;
    };
    struct {
      unsigned :3;
      unsigned LEB0:1;
      unsigned LEB1:1;
      unsigned LEB2:1;
      unsigned LEB3:1;
      unsigned LEB4:1;
      unsigned LEB5:1;
      unsigned LEB6:1;
      unsigned LEB7:1;
      unsigned LEB8:1;
    };
  };
} LEBDLY6BITS;
extern volatile LEBDLY6BITS LEBDLY6bits __attribute__((__sfr__));

#define AUXCON6 AUXCON6
extern volatile unsigned int  AUXCON6 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON6BITS {
  union {
    struct {
      unsigned CHOPLEN:1;
      unsigned CHOPHEN:1;
      unsigned CHOPSEL:4;
      unsigned :2;
      unsigned BLANKSEL:4;
      unsigned :2;
      unsigned HRDDIS:1;
      unsigned HRPDIS:1;
    };
    struct {
      unsigned :2;
      unsigned CHOPSEL0:1;
      unsigned CHOPSEL1:1;
      unsigned CHOPSEL2:1;
      unsigned CHOPSEL3:1;
      unsigned :2;
      unsigned BLANKSEL0:1;
      unsigned BLANKSEL1:1;
      unsigned BLANKSEL2:1;
      unsigned BLANKSEL3:1;
    };
  };
} AUXCON6BITS;
