Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM310.h
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile unsigned int  ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  unsigned ODCF0:1;
  unsigned ODCF1:1;
  unsigned :2;
  unsigned ODCF4:1;
  unsigned ODCF5:1;
  unsigned ODCF6:1;
  unsigned ODCF7:1;
  unsigned :1;
  unsigned ODCF9:1;
  unsigned ODCF10:1;
  unsigned :1;
  unsigned ODCF12:1;
  unsigned ODCF13:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define CNENF CNENF
extern volatile unsigned int  CNENF __attribute__((__sfr__));
typedef struct tagCNENFBITS {
  unsigned CNIEF0:1;
  unsigned CNIEF1:1;
  unsigned :2;
  unsigned CNIEF4:1;
  unsigned CNIEF5:1;
  unsigned CNIEF6:1;
  unsigned CNIEF7:1;
  unsigned :1;
  unsigned CNIEF9:1;
  unsigned CNIEF10:1;
  unsigned :1;
  unsigned CNIEF12:1;
  unsigned CNIEF13:1;
} CNENFBITS;
extern volatile CNENFBITS CNENFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile unsigned int  CNPUF __attribute__((__sfr__));
typedef struct tagCNPUFBITS {
  unsigned CNPUF0:1;
  unsigned CNPUF1:1;
  unsigned :2;
  unsigned CNPUF4:1;
  unsigned CNPUF5:1;
  unsigned CNPUF6:1;
  unsigned CNPUF7:1;
  unsigned :1;
  unsigned CNPUF9:1;
  unsigned CNPUF10:1;
  unsigned :1;
  unsigned CNPUF12:1;
  unsigned CNPUF13:1;
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile unsigned int  CNPDF __attribute__((__sfr__));
typedef struct tagCNPDFBITS {
  unsigned CNPDF0:1;
  unsigned CNPDF1:1;
  unsigned :2;
  unsigned CNPDF4:1;
  unsigned CNPDF5:1;
  unsigned CNPDF6:1;
  unsigned CNPDF7:1;
  unsigned :1;
  unsigned CNPDF9:1;
  unsigned CNPDF10:1;
  unsigned :1;
  unsigned CNPDF12:1;
  unsigned CNPDF13:1;
} CNPDFBITS;
extern volatile CNPDFBITS CNPDFbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile unsigned int  ANSELF __attribute__((__sfr__));
typedef struct tagANSELFBITS {
  unsigned :4;
  unsigned ANSF4:1;
  unsigned ANSF5:1;
  unsigned :3;
  unsigned ANSF9:1;
  unsigned ANSF10:1;
  unsigned :1;
  unsigned ANSF12:1;
  unsigned ANSF13:1;
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile unsigned int  TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  unsigned TRISG0:1;
  unsigned TRISG1:1;
  unsigned TRISG2:1;
  unsigned TRISG3:1;
  unsigned :2;
  unsigned TRISG6:1;
  unsigned TRISG7:1;
  unsigned TRISG8:1;
  unsigned TRISG9:1;
  unsigned TRISG10:1;
  unsigned TRISG11:1;
  unsigned TRISG12:1;
  unsigned TRISG13:1;
  unsigned TRISG14:1;
  unsigned TRISG15:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile unsigned int  PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  unsigned RG0:1;
  unsigned RG1:1;
  unsigned RG2:1;
  unsigned RG3:1;
  unsigned :2;
  unsigned RG6:1;
  unsigned RG7:1;
  unsigned RG8:1;
  unsigned RG9:1;
  unsigned RG10:1;
  unsigned RG11:1;
  unsigned RG12:1;
  unsigned RG13:1;
  unsigned RG14:1;
  unsigned RG15:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile unsigned int  LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  unsigned LATG0:1;
  unsigned LATG1:1;
  unsigned LATG2:1;
  unsigned LATG3:1;
  unsigned :2;
  unsigned LATG6:1;
  unsigned LATG7:1;
  unsigned LATG8:1;
  unsigned LATG9:1;
  unsigned LATG10:1;
  unsigned LATG11:1;
  unsigned LATG12:1;
  unsigned LATG13:1;
  unsigned LATG14:1;
  unsigned LATG15:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile unsigned int  ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  unsigned ODCG0:1;
  unsigned ODCG1:1;
  unsigned ODCG2:1;
  unsigned ODCG3:1;
  unsigned :2;
  unsigned ODCG6:1;
  unsigned ODCG7:1;
  unsigned ODCG8:1;
  unsigned ODCG9:1;
  unsigned ODCG10:1;
  unsigned ODCG11:1;
  unsigned ODCG12:1;
  unsigned ODCG13:1;
  unsigned ODCG14:1;
  unsigned ODCG15:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define CNENG CNENG
extern volatile unsigned int  CNENG __attribute__((__sfr__));
typedef struct tagCNENGBITS {
  unsigned CNIEG0:1;
  unsigned CNIEG1:1;
  unsigned CNIEG2:1;
  unsigned CNIEG3:1;
  unsigned :2;
  unsigned CNIEG6:1;
  unsigned CNIEG7:1;
  unsigned CNIEG8:1;
  unsigned CNIEG9:1;
  unsigned CNIEG10:1;
  unsigned CNIEG11:1;
  unsigned CNIEG12:1;
  unsigned CNIEG13:1;
  unsigned CNIEG14:1;
  unsigned CNIEG15:1;
} CNENGBITS;
extern volatile CNENGBITS CNENGbits __attribute__((__sfr__));

#define CNPUG CNPUG
extern volatile unsigned int  CNPUG __attribute__((__sfr__));
typedef struct tagCNPUGBITS {
  unsigned CNPUG0:1;
  unsigned CNPUG1:1;
  unsigned CNPUG2:1;
  unsigned CNPUG3:1;
  unsigned :2;
  unsigned CNPUG6:1;
  unsigned CNPUG7:1;
  unsigned CNPUG8:1;
  unsigned CNPUG9:1;
  unsigned CNPUG10:1;
  unsigned CNPUG11:1;
  unsigned CNPUG12:1;
  unsigned CNPUG13:1;
  unsigned CNPUG14:1;
  unsigned CNPUG15:1;
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile unsigned int  CNPDG __attribute__((__sfr__));
typedef struct tagCNPDGBITS {
  unsigned CNPDG0:1;
  unsigned CNPDG1:1;
  unsigned CNPDG2:1;
  unsigned CNPDG3:1;
  unsigned :2;
  unsigned CNPDG6:1;
  unsigned CNPDG7:1;
  unsigned CNPDG8:1;
  unsigned CNPDG9:1;
  unsigned CNPDG10:1;
  unsigned CNPDG11:1;
  unsigned CNPDG12:1;
  unsigned CNPDG13:1;
  unsigned CNPDG14:1;
  unsigned CNPDG15:1;
} CNPDGBITS;
extern volatile CNPDGBITS CNPDGbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile unsigned int  ANSELG __attribute__((__sfr__));
typedef struct tagANSELGBITS {
  unsigned :2;
  unsigned ANSG2:1;
  unsigned ANSG3:1;
  unsigned :2;
  unsigned ANSG6:1;
  unsigned ANSG7:1;
  unsigned ANSG8:1;
  unsigned ANSG9:1;
  unsigned ANSG10:1;
  unsigned ANSG11:1;
  unsigned :3;
  unsigned ANSG15:1;
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile unsigned int  PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  unsigned PMPTTL:1;
  unsigned RTSECSEL:1;
} PADCFG1BITS;
