Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM310.h
#define _QEI2STAT_IDXIEN_POSITION                0x00000000
#define _QEI2STAT_IDXIEN_MASK                    0x00000001
#define _QEI2STAT_IDXIEN_LENGTH                  0x00000001

#define _QEI2STAT_IDXIRQ_POSITION                0x00000001
#define _QEI2STAT_IDXIRQ_MASK                    0x00000002
#define _QEI2STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI2STAT_HOMIEN_POSITION                0x00000002
#define _QEI2STAT_HOMIEN_MASK                    0x00000004
#define _QEI2STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI2STAT_HOMIRQ_POSITION                0x00000003
#define _QEI2STAT_HOMIRQ_MASK                    0x00000008
#define _QEI2STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI2STAT_VELOVIEN_POSITION              0x00000004
#define _QEI2STAT_VELOVIEN_MASK                  0x00000010
#define _QEI2STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI2STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI2STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI2STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCIIEN_POSITION                0x00000006
#define _QEI2STAT_PCIIEN_MASK                    0x00000040
#define _QEI2STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI2STAT_PCIIRQ_POSITION                0x00000007
#define _QEI2STAT_PCIIRQ_MASK                    0x00000080
#define _QEI2STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI2STAT_POSOVIEN_POSITION              0x00000008
#define _QEI2STAT_POSOVIEN_MASK                  0x00000100
#define _QEI2STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI2STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI2STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI2STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI2STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI2STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI2STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI2STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI2STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI2STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI2STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI2STAT_PCHEQIRQ_LENGTH                0x00000001

#define _PMCON_RDSP_POSITION                     0x00000000
#define _PMCON_RDSP_MASK                         0x00000001
#define _PMCON_RDSP_LENGTH                       0x00000001

#define _PMCON_WRSP_POSITION                     0x00000001
#define _PMCON_WRSP_MASK                         0x00000002
#define _PMCON_WRSP_LENGTH                       0x00000001

#define _PMCON_BEP_POSITION                      0x00000002
#define _PMCON_BEP_MASK                          0x00000004
#define _PMCON_BEP_LENGTH                        0x00000001

#define _PMCON_CS1P_POSITION                     0x00000003
#define _PMCON_CS1P_MASK                         0x00000008
#define _PMCON_CS1P_LENGTH                       0x00000001

#define _PMCON_CS2P_POSITION                     0x00000004
#define _PMCON_CS2P_MASK                         0x00000010
#define _PMCON_CS2P_LENGTH                       0x00000001

#define _PMCON_ALP_POSITION                      0x00000005
#define _PMCON_ALP_MASK                          0x00000020
#define _PMCON_ALP_LENGTH                        0x00000001

#define _PMCON_CSF_POSITION                      0x00000006
#define _PMCON_CSF_MASK                          0x000000C0
#define _PMCON_CSF_LENGTH                        0x00000002

#define _PMCON_PTRDEN_POSITION                   0x00000008
#define _PMCON_PTRDEN_MASK                       0x00000100
#define _PMCON_PTRDEN_LENGTH                     0x00000001

#define _PMCON_PTWREN_POSITION                   0x00000009
#define _PMCON_PTWREN_MASK                       0x00000200
#define _PMCON_PTWREN_LENGTH                     0x00000001

#define _PMCON_PTBEEN_POSITION                   0x0000000A
#define _PMCON_PTBEEN_MASK                       0x00000400
#define _PMCON_PTBEEN_LENGTH                     0x00000001

#define _PMCON_ADRMUX_POSITION                   0x0000000B
#define _PMCON_ADRMUX_MASK                       0x00001800
#define _PMCON_ADRMUX_LENGTH                     0x00000002

#define _PMCON_PSIDL_POSITION                    0x0000000D
#define _PMCON_PSIDL_MASK                        0x00002000
#define _PMCON_PSIDL_LENGTH                      0x00000001

#define _PMCON_PMPEN_POSITION                    0x0000000F
#define _PMCON_PMPEN_MASK                        0x00008000
#define _PMCON_PMPEN_LENGTH                      0x00000001

#define _PMCON_CSF0_POSITION                     0x00000006
#define _PMCON_CSF0_MASK                         0x00000040
#define _PMCON_CSF0_LENGTH                       0x00000001

#define _PMCON_CSF1_POSITION                     0x00000007
#define _PMCON_CSF1_MASK                         0x00000080
#define _PMCON_CSF1_LENGTH                       0x00000001

#define _PMCON_ADRMUX0_POSITION                  0x0000000B
#define _PMCON_ADRMUX0_MASK                      0x00000800
#define _PMCON_ADRMUX0_LENGTH                    0x00000001

#define _PMCON_ADRMUX1_POSITION                  0x0000000C
#define _PMCON_ADRMUX1_MASK                      0x00001000
#define _PMCON_ADRMUX1_LENGTH                    0x00000001

#define _PMMODE_WAITE_POSITION                   0x00000000
#define _PMMODE_WAITE_MASK                       0x00000003
#define _PMMODE_WAITE_LENGTH                     0x00000002

#define _PMMODE_WAITM_POSITION                   0x00000002
#define _PMMODE_WAITM_MASK                       0x0000003C
#define _PMMODE_WAITM_LENGTH                     0x00000004

#define _PMMODE_WAITB_POSITION                   0x00000006
#define _PMMODE_WAITB_MASK                       0x000000C0
#define _PMMODE_WAITB_LENGTH                     0x00000002

