Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM310.h
#define _IFS2_IC5IF_POSITION                     0x00000007
#define _IFS2_IC5IF_MASK                         0x00000080
#define _IFS2_IC5IF_LENGTH                       0x00000001

#define _IFS2_IC6IF_POSITION                     0x00000008
#define _IFS2_IC6IF_MASK                         0x00000100
#define _IFS2_IC6IF_LENGTH                       0x00000001

#define _IFS2_OC5IF_POSITION                     0x00000009
#define _IFS2_OC5IF_MASK                         0x00000200
#define _IFS2_OC5IF_LENGTH                       0x00000001

#define _IFS2_OC6IF_POSITION                     0x0000000A
#define _IFS2_OC6IF_MASK                         0x00000400
#define _IFS2_OC6IF_LENGTH                       0x00000001

#define _IFS2_OC7IF_POSITION                     0x0000000B
#define _IFS2_OC7IF_MASK                         0x00000800
#define _IFS2_OC7IF_LENGTH                       0x00000001

#define _IFS2_OC8IF_POSITION                     0x0000000C
#define _IFS2_OC8IF_MASK                         0x00001000
#define _IFS2_OC8IF_LENGTH                       0x00000001

#define _IFS2_PMPIF_POSITION                     0x0000000D
#define _IFS2_PMPIF_MASK                         0x00002000
#define _IFS2_PMPIF_LENGTH                       0x00000001

#define _IFS2_T6IF_POSITION                      0x0000000F
#define _IFS2_T6IF_MASK                          0x00008000
#define _IFS2_T6IF_LENGTH                        0x00000001

#define _IFS3_T7IF_POSITION                      0x00000000
#define _IFS3_T7IF_MASK                          0x00000001
#define _IFS3_T7IF_LENGTH                        0x00000001

#define _IFS3_SI2C2IF_POSITION                   0x00000001
#define _IFS3_SI2C2IF_MASK                       0x00000002
#define _IFS3_SI2C2IF_LENGTH                     0x00000001

#define _IFS3_MI2C2IF_POSITION                   0x00000002
#define _IFS3_MI2C2IF_MASK                       0x00000004
#define _IFS3_MI2C2IF_LENGTH                     0x00000001

#define _IFS3_T8IF_POSITION                      0x00000003
#define _IFS3_T8IF_MASK                          0x00000008
#define _IFS3_T8IF_LENGTH                        0x00000001

#define _IFS3_T9IF_POSITION                      0x00000004
#define _IFS3_T9IF_MASK                          0x00000010
#define _IFS3_T9IF_LENGTH                        0x00000001

#define _IFS3_INT3IF_POSITION                    0x00000005
#define _IFS3_INT3IF_MASK                        0x00000020
#define _IFS3_INT3IF_LENGTH                      0x00000001

#define _IFS3_INT4IF_POSITION                    0x00000006
#define _IFS3_INT4IF_MASK                        0x00000040
#define _IFS3_INT4IF_LENGTH                      0x00000001

#define _IFS3_PSEMIF_POSITION                    0x00000009
#define _IFS3_PSEMIF_MASK                        0x00000200
#define _IFS3_PSEMIF_LENGTH                      0x00000001

#define _IFS3_QEI1IF_POSITION                    0x0000000A
#define _IFS3_QEI1IF_MASK                        0x00000400
#define _IFS3_QEI1IF_LENGTH                      0x00000001

#define _IFS3_DCIEIF_POSITION                    0x0000000B
#define _IFS3_DCIEIF_MASK                        0x00000800
#define _IFS3_DCIEIF_LENGTH                      0x00000001

#define _IFS3_DCIIF_POSITION                     0x0000000C
#define _IFS3_DCIIF_MASK                         0x00001000
#define _IFS3_DCIIF_LENGTH                       0x00000001

#define _IFS3_RTCCIF_POSITION                    0x0000000E
#define _IFS3_RTCCIF_MASK                        0x00004000
#define _IFS3_RTCCIF_LENGTH                      0x00000001

#define _IFS4_U1EIF_POSITION                     0x00000001
#define _IFS4_U1EIF_MASK                         0x00000002
#define _IFS4_U1EIF_LENGTH                       0x00000001

#define _IFS4_U2EIF_POSITION                     0x00000002
#define _IFS4_U2EIF_MASK                         0x00000004
#define _IFS4_U2EIF_LENGTH                       0x00000001

#define _IFS4_CRCIF_POSITION                     0x00000003
#define _IFS4_CRCIF_MASK                         0x00000008
#define _IFS4_CRCIF_LENGTH                       0x00000001

#define _IFS4_PSESMIF_POSITION                   0x00000009
#define _IFS4_PSESMIF_MASK                       0x00000200
#define _IFS4_PSESMIF_LENGTH                     0x00000001

#define _IFS4_QEI2IF_POSITION                    0x0000000B
#define _IFS4_QEI2IF_MASK                        0x00000800
#define _IFS4_QEI2IF_LENGTH                      0x00000001

#define _IFS4_CTMUIF_POSITION                    0x0000000D
#define _IFS4_CTMUIF_MASK                        0x00002000
#define _IFS4_CTMUIF_LENGTH                      0x00000001

#define _IFS5_U3EIF_POSITION                     0x00000001
#define _IFS5_U3EIF_MASK                         0x00000002
#define _IFS5_U3EIF_LENGTH                       0x00000001

#define _IFS5_U3RXIF_POSITION                    0x00000002
#define _IFS5_U3RXIF_MASK                        0x00000004
#define _IFS5_U3RXIF_LENGTH                      0x00000001

#define _IFS5_U3TXIF_POSITION                    0x00000003
#define _IFS5_U3TXIF_MASK                        0x00000008
#define _IFS5_U3TXIF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x00000007
#define _IFS5_U4EIF_MASK                         0x00000080
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_SPI3EIF_POSITION                   0x0000000A
#define _IFS5_SPI3EIF_MASK                       0x00000400
#define _IFS5_SPI3EIF_LENGTH                     0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000B
#define _IFS5_SPI3IF_MASK                        0x00000800
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000E
#define _IFS5_PWM1IF_MASK                        0x00004000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000F
#define _IFS5_PWM2IF_MASK                        0x00008000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS6_PWM3IF_POSITION                    0x00000000
#define _IFS6_PWM3IF_MASK                        0x00000001
#define _IFS6_PWM3IF_LENGTH                      0x00000001

#define _IFS6_PWM4IF_POSITION                    0x00000001
#define _IFS6_PWM4IF_MASK                        0x00000002
#define _IFS6_PWM4IF_LENGTH                      0x00000001

#define _IFS6_PWM5IF_POSITION                    0x00000002
#define _IFS6_PWM5IF_MASK                        0x00000004
#define _IFS6_PWM5IF_LENGTH                      0x00000001

